{
  "_name_or_path": "C:\\Users\\91994\\.cache\\huggingface\\hub\\models--medmac01--beldi-moroccan-interior-2\\snapshots\\ef8f6b0f9b80f855cf1529e1b9653afd6f4a0b6c\\safety_checker",
  "architectures": [
    "StableDiffusionSafetyChecker"
  ],
  "initializer_factor": 1.0,
  "logit_scale_init_value": 2.6592,
  "model_type": "clip",
  "projection_dim": 768,
  "text_config": {
    "bos_token_id": 0,
    "dropout": 0.0,
    "eos_token_id": 2,
    "hidden_size": 768,
    "intermediate_size": 3072,
    "model_type": "clip_text_model",
    "num_attention_heads": 12
  },
  "torch_dtype": "float32",
  "transformers_version": "4.46.2",
  "vision_config": {
    "_attn_implementation_autoset": true,
    "dropout": 0.0,
    "hidden_size": 1024,
    "intermediate_size": 4096,
    "model_type": "clip_vision_model",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "patch_size": 14
  }
}
